Repository: Supawit732/JourneyTH-app
Catalog: JourneyTH/Resources/Localizations/*.lproj/Localizable.strings
Languages: th

# discover.title
source: Discover
th: สำรวจ

# discover.filter.area
source: Area
th: พื้นที่

# discover.filter.all
source: All
th: ทั้งหมด

# discover.empty.title
source: Nothing to show
th: ไม่พบข้อมูล

# discover.empty.subtitle
source: Adjust the filters or pull to refresh to see more ideas.
th: ปรับตัวกรองหรือดึงเพื่อรีเฟรชเพื่อดูสถานที่เพิ่มเติม

# discover.rating
source: Rating
th: เรตติ้ง

# discover.add
source: Add to itinerary
th: เพิ่มในทริป

# discover.add.accessibility
source: Add %@ to itinerary
th: เพิ่ม %@ ในทริป

# shared.try.again
source: Try again
th: ลองอีกครั้ง

# shared.loading
source: Loading
th: กำลังโหลด

# shared.minutes.unit
source: mins
th: นาที

# itinerary.title
source: Itinerary
th: ทริปของฉัน

# itinerary.empty.title
source: Plan your Journey
th: เริ่มวางแผนการเดินทาง

# itinerary.empty.subtitle
source: Save favourite spots from Discover to map out your day.
th: บันทึกสถานที่ที่ชอบจากหน้า สำรวจ เพื่อจัดตารางของคุณ

# itinerary.total
source: Total time: %d %@
th: เวลารวม: %d %@

# itinerary.share
source: Share itinerary
th: แชร์แผนทริป

# transport.title
source: Transport
th: การเดินทาง

# transport.origin
source: Origin
th: ต้นทาง

# transport.destination
source: Destination
th: ปลายทาง

# transport.calculate
source: Estimate fares
th: คำนวณค่าโดยสาร

# transport.tip
source: Pick locations to calculate an estimated distance and fare.
th: เลือกจุดหมายเพื่อประมาณระยะทางและค่าโดยสาร

# transport.disclaimer
source: Estimates are approximate for Bangkok travel. Actual fares vary with traffic and driver discretion.
th: ตัวเลขเป็นการประมาณสำหรับการเดินทางในกรุงเทพฯ ค่าใช้จ่ายจริงขึ้นอยู่กับสภาพจราจรและผู้ให้บริการ

# transport.mode.poi
source: POI
th: สถานที่

# transport.mode.manual
source: Manual
th: กำหนดเอง

# transport.poi.placeholder
source: Select a point of interest
th: เลือกสถานที่ท่องเที่ยว

# transport.lat
source: Latitude
th: ละติจูด

# transport.lng
source: Longitude
th: ลองจิจูด

# transport.distance
source: ~%.1f km
th: ~%.1f กม.

# transport.taxi
source: Taxi
th: แท็กซี่

# transport.tuktuk
source: Tuk Tuk
th: ตุ๊กตุ๊ก

# transport.moto
source: Motorbike taxi
th: วินมอเตอร์ไซค์

# transport.moto.notes
source: Possible surcharges
th: อาจมีค่าบริการเพิ่ม

# transport.surcharge.rain
source: Rain
th: ฝน

# transport.surcharge.night
source: Night
th: กลางคืน

# transport.invalid.coords
source: Please provide valid coordinates
th: กรุณากรอกพิกัดให้ถูกต้อง

# rail.title
source: Rail
th: รถไฟ

# rail.calculate
source: Estimate rail fare
th: คำนวณค่าโดยสารรถไฟ

# rail.tip
source: Select stations to preview an estimated fare and distance.
th: เลือกสถานีเพื่อดูค่าโดยสารและระยะทางประมาณ

# rail.disclaimer
source: Estimates are for planning only and do not replace official rail fares.
th: ตัวเลขใช้เพื่อการวางแผนเท่านั้น ไม่ใช่อัตราค่าโดยสารทางการ

# rail.map
source: Rail network map
th: แผนที่เครือข่ายรถไฟ

# rail.from
source: From
th: ต้นทาง

# rail.to
source: To
th: ปลายทาง

# rail.summary
source: %@ → %@ • ~%.1f km
th: %@ → %@ • ~%.1f กม.

# rail.urban.bts
source: BTS urban rail
th: รถไฟฟ้า BTS

# rail.urban.mrt
source: MRT urban rail
th: รถไฟฟ้า MRT

# rail.urban.arl
source: ARL airport rail
th: แอร์พอร์ต เรล ลิงก์

# rail.intercity
source: State Railway intercity segment
th: รถไฟทางไกล รฟท.

# rail.open.maps
source: Open in Apple Maps
th: เปิดใน Apple Maps

# rail.invalid.selection
source: Select two different stations
th: กรุณาเลือกสถานีที่แตกต่างกัน

# about.title
source: About
th: เกี่ยวกับ

# about.tagline
source: Local-first mobility insights for Thailand travellers.
th: ข้อมูลการเดินทางในไทยแบบออฟไลน์สำหรับนักท่องเที่ยว

# about.methodology
source: Methodology
th: วิธีคำนวณ

# about.methodology.fares
source: Taxi, tuk tuk, and moto fares follow tiered formulas from fares_config.json.
th: ค่าแท็กซี่ ตุ๊กตุ๊ก และวิน คำนวณตามสูตรในไฟล์ fares_config.json

# about.methodology.rail
source: Rail estimates combine stop counts for BTS/MRT/ARL and distance pricing for SRT.
th: ค่าโดยสารรถไฟฟ้าใช้จำนวนสถานี และรถไฟทางไกลใช้ระยะทางตาม config

# about.methodology.itinerary
source: Itinerary data is stored locally using Core Data for offline access.
th: แผนทริปบันทึกไว้ในเครื่องด้วย Core Data

# about.data
source: Data
th: ข้อมูล

# about.data.pois
source: Points of interest: pois.json
th: สถานที่ท่องเที่ยว: pois.json

# about.data.fares
source: Fare formulas: fares_config.json
th: สูตรค่าโดยสาร: fares_config.json

# about.data.stations
source: Stations & lines: stations.json
th: สถานีและเส้นทาง: stations.json

# about.credits
source: Credits
th: เครดิต

# about.credits.text
source: Built for the JourneyTH MVP. Map data © contributors, imagery © Apple.
th: พัฒนาเพื่อ JourneyTH MVP ข้อมูลแผนที่ © ผู้จัดทำ ภาพ © Apple

# about.disclaimer
source: JourneyTH is a concept experience with illustrative pricing only.
th: JourneyTH เป็นต้นแบบ ตัวเลขมีไว้เพื่อการอธิบายเท่านั้น

# account.title
source: Settings
th: การตั้งค่า

# account.profile.section
source: Profile
th: โปรไฟล์

# account.local.profile
source: Offline traveller profile
th: โปรไฟล์ออฟไลน์

# account.language.toggle
source: Use Thai language
th: ใช้ภาษาไทย

# account.version
source: Version
th: เวอร์ชัน

# account.settings.section
source: Local data
th: ข้อมูลในเครื่อง

# account.clear.data
source: Clear itinerary
th: ล้างแผนทริป

# account.cleared
source: Itinerary cleared
th: ลบแผนทริปเรียบร้อย
